INSERT INTO type (TypeID, Name) VALUES
(1, 'วิชาพื้นฐานอักษรศาสตร์'),
(2, 'วิชาการศึกษาทั่วไปนอกคณะ (Gen-Ed) - กลุ่มสังคมศาสตร์'),
(3, 'วิชาการศึกษาทั่วไปนอกคณะ (Gen-Ed) - กลุ่มมนุษยศาสตร์'),
(4, 'วิชาการศึกษาทั่วไปนอกคณะ (Gen-Ed) - กลุ่มวิทยาศาสตร์และคณิตศาสตร์'),
(5, 'วิชาการศึกษาทั่วไปนอกคณะ (Gen-Ed) - กลุ่มสหศาสตร์'),
(6, 'วิชาการศึกษาทั่วไปกลุ่มภาษาต่างประเทศ (Gen-Lang) - ภาษาอังกฤษ'),
(7, 'วิชาการศึกษาทั่วไปกลุ่มภาษาต่างประเทศ (Gen-Lang) - ภาษาที่สาม'),
(8, 'วิชาการศึกษาทั่วไปกลุ่มพิเศษ'),
(9, 'วิชาบังคับ'),
(10, 'วิชาเลือกในสาขา'),
(11, 'วิชาเลือกเสรี');
